artifacts/window_ttft_online/window_ttft_online_20260421_134059/client.log
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=0, dataset_name='random-ids', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=360, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1, random_range_ratio=0.3, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=2.0, use_trace_timestamps=False, max_concurrency=64, output_file='/sgl-workspace/sglang/artifacts/window_ttft_online/window_ttft_online_20260421_134059/bench_output.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=True, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=20260421, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=0, dataset_name='random-ids', dataset_path='', model='/media/ssd1/glm-5-nvfp4', served_model_name=None, tokenizer=None, num_prompts=360, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1, random_range_ratio=0.3, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=2.0, use_trace_timestamps=False, max_concurrency=64, output_file='/sgl-workspace/sglang/artifacts/window_ttft_online/window_ttft_online_20260421_134059/bench_output.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=True, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=20260421, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 934398
#Output tokens: 360
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 360/360 [03:08<00:00,  1.91it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    2.0       
Max request concurrency:                 64        
Successful requests:                     360       
Benchmark duration (s):                  188.87    
Total input tokens:                      934398    
Total input text tokens:                 934398    
Total generated tokens:                  360       
Total generated tokens (retokenized):    0         
Request throughput (req/s):              1.91      
Input token throughput (tok/s):          4947.26   
Output token throughput (tok/s):         1.91      
Peak output token throughput (tok/s):    7.00      
Peak concurrent requests:                9         
Total token throughput (tok/s):          4949.17   
Concurrency:                             0.61      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   320.59    
Median E2E Latency (ms):                 300.37    
P90 E2E Latency (ms):                    457.97    
P99 E2E Latency (ms):                    610.46    
---------------Time to First Token----------------
Mean TTFT (ms):                          320.59    
Median TTFT (ms):                        300.37    
P99 TTFT (ms):                           610.46    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================